/*
 * Ввести с клавиатуры любое слово. Используя генерацию случайных чисел, переставить
 * буквы этого слова в случайном порядке. Делать это до тех пор, пока полученное слово не совпадёт
 * с начальным словом. Выводить слово после каждой перестановки и посчитать общее количество
 * выведенных слов (не считая исходного). Пример выполнения программы:
 * Введите слово: корова
 * воакро
 * вокроа
 * ароовк
 * краоов
 * крваоо
 * оокавр
 * ооквра
 * вкраоо
 * корова
 * 9 попыток
 */

//#include "text_shuffler.h"
//
//int main3() {
//    std::string word;
//    std::cout << "Enter a word: ";
//    std::cin >> word;
//
//    if (word.empty()) {
//        std::cerr << "Error: Empty word entered." << std::endl;
//        return 1;
//    }
//
//    int attempts = ShuffleWordUntilMatch(word);
//    std::cout << attempts << " try" << std::endl;
//
//    return 0;
//}
